Revit 2026 API

# ReferenceIntersector(ICollectionElementId, FindReferenceTarget, View3D) Constructor

---

Initializes a new instance of the ReferenceIntersector class

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ReferenceIntersector(
	ICollection<ElementId> targetElementIds,
	FindReferenceTarget targetType,
	View3D view3d
)
```
```vb
Public Sub New (
	targetElementIds As ICollection(Of ElementId),
	targetType As FindReferenceTarget,
	view3d As View3D
)
```
```cpp
public:
ReferenceIntersector(
	ICollection<ElementId^>^ targetElementIds,
	FindReferenceTarget targetType,
	View3D^ view3d
)
```
```fsharp
new :
        targetElementIds : ICollection<ElementId> *
        targetType : FindReferenceTarget *
        view3d : View3D -> ReferenceIntersector
```

#### Parameters

targetElementIds ICollectionElementId

targetType FindReferenceTarget

view3d View3D

#### Reference

ReferenceIntersector Class

ReferenceIntersector Overload

Autodesk.Revit.DB Namespace